#Generated by Fabric Compiler ( version 2022.2-SP6.1 <build 138931> ) at Tue Sep  2 17:46:49 2025

add_design "D:/Pony/dev_board/ryan_ad/3pa1030_test/source/top.v"
add_design D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/ad_clock/ad_clock.idf
add_design D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/debug/debug.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module TOP
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module TOP
add_constraint "D:/Pony/dev_board/ryan_ad/3pa1030_test/project.fdc"
remove_design -force D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/debug/debug.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/Pony/dev_board/ryan_ad/3pa1030_test/synthesize/TOP_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"D:/Pony/dev_board/ryan_ad/3pa1030_test/synthesize/TOP_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "D:/Pony/dev_board/ryan_ad/3pa1030_test/synthesize/top_syn.fic"
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/ffttest/ffttest.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/fdfdttt/fdfdttt.idf
add_simulation "D:/Pony/dev_board/ryan_ad/3pa1030_test/source/top.v"
add_simulation "D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/ffttest/ffttest_tmpl.v"
remove_simulation "D:/Pony/dev_board/ryan_ad/3pa1030_test/source/top.v"
add_simulation "D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/ffttest/ffttest.v"
add_design D:/Pony/dev_board/ryan_ad/3pa1030_test/ipcore/my_fft/my_fft.idf
add_constraint "D:/Pony/dev_board/ryan_ad/3pa1030_test/source/70h_test.fdc"
remove_constraint -force -logic -fdc "D:/Pony/dev_board/ryan_ad/3pa1030_test/source/70h_test.fdc"
remove_design -force E:/3pa1030_test/ipcore/ffttest/ffttest.idf
remove_design -force E:/3pa1030_test/ipcore/my_fft/my_fft.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
